<h1><center> Data Analysis: Introduction to Pandas </center></h1>

<h2> Part IV. Merging files </h2>

<i>Example 1. Import the necessary libraries</i>

In [1]:
import pandas as pd
import numpy as np

<b>Exercise 1. Create the 3 dictionaries with the given attributes like the followings:</b><br>

|<b></b>|<b></b>|
|---|---|
|<b><center>data1</center></b><img src="data1.png" alt="student" style="width:3cm;height:4cm" />|<b><center>data2</center></b><img src="data2.png" alt="student" style="width:3cm;height:2.5cm" />|
|<b><center>data3</center></b><img src="data3.png" alt="student" style="width:2.25cm;height:3.75cm" />|<b><center>data4</center></b><img src="data4.png" alt="student" style="width:3cm;height:4cm" />|

In [9]:
# Create data1 dictionary (students 1-15)
data1 = {
    'student_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10,11, 12, 13, 14, 15],
    'first_name': ['Mony', 'Nana', 'Ray', 'Alice', 'Ratanak', 'Nara', 'Ratana', 'Roth', 'Rith', 'Johnny','John', 'Frank', 'James', 'Tom', 'Jennifer'],
    'last_name': ['Sopheak', 'Tanaka', 'Allen', 'May', 'Sam', 'Kun', 'Vann', 'Sovann', 'Harrison', 'Cole','Bond', 'Little', 'Collar', 'Brune', 'Stone']
}

# Create data2 dictionary (subjects)
data2 = {
    'subject_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'subject_name': ['Math', 'Geography', 'History', 'Literature', 'Research', 'IT', 'Moral', 'Art', 'Earth Science', 'Physics']
}

# Create data3 dictionary (test scores)
data3 = {
    'student_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'subject_id': [1, 3, 7, 8, 5, 4, 2, 7, 1, 6],
    'test_score': [55, 75, 65, 93, 76, 80, 77, 81, 63, 89]
}

data1 = pd.DataFrame(data1)
data2 = pd.DataFrame(data2)
data3 = pd.DataFrame(data3)

print(data1)
print(data2)
print(data3)

    student_id first_name last_name
0            1       Mony   Sopheak
1            2       Nana    Tanaka
2            3        Ray     Allen
3            4      Alice       May
4            5    Ratanak       Sam
5            6       Nara       Kun
6            7     Ratana      Vann
7            8       Roth    Sovann
8            9       Rith  Harrison
9           10     Johnny      Cole
10          11       John      Bond
11          12      Frank    Little
12          13      James    Collar
13          14        Tom     Brune
14          15   Jennifer     Stone
   subject_id   subject_name
0           1           Math
1           2      Geography
2           3        History
3           4     Literature
4           5       Research
5           6             IT
6           7          Moral
7           8            Art
8           9  Earth Science
9          10        Physics
   student_id  subject_id  test_score
0           1           1          55
1           2           3          75
2           3           7          65
3           4           8          93
4           5           5          76
5           6           4          80
6           7           2          77
7           8           7          81
8           9           1          63
9          10           6          89

<b>Exercise 2. Create the 3 DataFrames from the dictionaries.</b>

In [ ]:
# DataFrame from data1 (all students)
df1 = pd.DataFrame(data1)
print('DataFrame 1 (All Students):')
display(df1)

# DataFrame from data2 (subjects)
df2 = pd.DataFrame(data2)
print('\nDataFrame 2 (Subjects):')
display(df2)

# DataFrame from data3 (test scores)
df3 = pd.DataFrame(data3)
print('\nDataFrame 3 (Test Scores):')
display(df3)

DataFrame 1 (All Students):

    student_id first_name last_name
0            1       Mony   Sopheak
1            2       Nana    Tanaka
2            3        Ray     Allen
3            4      Alice       May
4            5    Ratanak       Sam
5            6       Nara       Kun
6            7     Ratana      Vann
7            8       Roth    Sovann
8            9       Rith  Harrison
9           10     Johnny      Cole
10          11       John      Bond
11          12      Frank    Little
12          13      James    Collar
13          14        Tom     Brune
14          15   Jennifer     Stone

DataFrame 2 (Subjects):

   subject_id   subject_name
0           1           Math
1           2      Geography
2           3        History
3           4     Literature
4           5       Research
5           6             IT
6           7          Moral
7           8            Art
8           9  Earth Science
9          10        Physics

DataFrame 3 (Test Scores):

   student_id  subject_id  test_score
0           1           1          55
1           2           3          75
2           3           7          65
3           4           8          93
4           5           5          76
5           6           4          80
6           7           2          77
7           8           7          81
8           9           1          63
9          10           6          89

<b>Exercise 3. Concat data1 and data2 Dataframes placing the data2 under data1.</b>

In [13]:
ex3 = pd.concat([df1, df2], axis=0, ignore_index=True)
print('data2 under data1:')
display(ex3)

data2 under data1:

    student_id first_name last_name  subject_id   subject_name
0          1.0       Mony   Sopheak         NaN            NaN
1          2.0       Nana    Tanaka         NaN            NaN
2          3.0        Ray     Allen         NaN            NaN
3          4.0      Alice       May         NaN            NaN
4          5.0    Ratanak       Sam         NaN            NaN
5          6.0       Nara       Kun         NaN            NaN
6          7.0     Ratana      Vann         NaN            NaN
7          8.0       Roth    Sovann         NaN            NaN
8          9.0       Rith  Harrison         NaN            NaN
9         10.0     Johnny      Cole         NaN            NaN
10        11.0       John      Bond         NaN            NaN
11        12.0      Frank    Little         NaN            NaN
12        13.0      James    Collar         NaN            NaN
13        14.0        Tom     Brune         NaN            NaN
14        15.0   Jennifer     Stone         NaN            NaN
15         NaN        NaN       NaN         1.0           Math
16         NaN        NaN       NaN         2.0      Geography
17         NaN        NaN       NaN         3.0        History
18         NaN        NaN       NaN         4.0     Literature
19         NaN        NaN       NaN         5.0       Research
20         NaN        NaN       NaN         6.0             IT
21         NaN        NaN       NaN         7.0          Moral
22         NaN        NaN       NaN         8.0            Art
23         NaN        NaN       NaN         9.0  Earth Science
24         NaN        NaN       NaN        10.0        Physics

<b>Exercise 4. Concat data1 and data2 Dataframes placing the data2 on the right side of data1.</b>

In [18]:
ex4 = pd.concat([df1, df2], axis=1)
print('data2 on the right side of data1:')
display(ex4)

data2 on the right side of data1:

    student_id first_name last_name  subject_id   subject_name
0            1       Mony   Sopheak         1.0           Math
1            2       Nana    Tanaka         2.0      Geography
2            3        Ray     Allen         3.0        History
3            4      Alice       May         4.0     Literature
4            5    Ratanak       Sam         5.0       Research
5            6       Nara       Kun         6.0             IT
6            7     Ratana      Vann         7.0          Moral
7            8       Roth    Sovann         8.0            Art
8            9       Rith  Harrison         9.0  Earth Science
9           10     Johnny      Cole        10.0        Physics
10          11       John      Bond         NaN            NaN
11          12      Frank    Little         NaN            NaN
12          13      James    Collar         NaN            NaN
13          14        Tom     Brune         NaN            NaN
14          15   Jennifer     Stone         NaN            NaN

<b>Exercise 5. Merge the result in <i>Exercise 3</i> with data4 and display the result.</b>

In [26]:
ex5 = pd.merge(df1, df3, on='student_id', how='left')
ex5 = pd.merge(ex5, df2, on='subject_id', how='left')
print('merge ex3 with data4:')
display(ex5)

merge ex3 with data4:

    student_id first_name last_name  subject_id  test_score subject_name
0            1       Mony   Sopheak         1.0        55.0         Math
1            2       Nana    Tanaka         3.0        75.0      History
2            3        Ray     Allen         7.0        65.0        Moral
3            4      Alice       May         8.0        93.0          Art
4            5    Ratanak       Sam         5.0        76.0     Research
5            6       Nara       Kun         4.0        80.0   Literature
6            7     Ratana      Vann         2.0        77.0    Geography
7            8       Roth    Sovann         7.0        81.0        Moral
8            9       Rith  Harrison         1.0        63.0         Math
9           10     Johnny      Cole         6.0        89.0           IT
10          11       John      Bond         NaN         NaN          NaN
11          12      Frank    Little         NaN         NaN          NaN
12          13      James    Collar         NaN         NaN          NaN
13          14        Tom     Brune         NaN         NaN          NaN
14          15   Jennifer     Stone         NaN         NaN          NaN

<b>Exercise 6. How many points does Johnny Cole get in the test? Display the information, score and subjects of Johnny Cole.</b>

In [27]:
johnny_info = ex5[(ex5['first_name'] == 'Johnny') & (ex5['last_name'] == 'Cole')]
print('Johnny Cole Test Information:')
display(johnny_info)
# To display just the score
print(f"\nJohnny Cole's test score: {johnny_info['test_score'].values[0]} points")

Johnny Cole Test Information:

   student_id first_name last_name  subject_id  test_score subject_name
9          10     Johnny      Cole         6.0        89.0           IT

Johnny Cole's test score: 89.0 points

<b>Exercise 7. Which subject does Nara Kun take the test on? Display the information, score and subjects of Nara Kun.

In [28]:
nara_info = ex5[(ex5['first_name'] == 'Nara') & (ex5['last_name'] == 'Kun')]
print('Nara Kun Test Information:')
display(nara_info)
# To display just the subject
print(f"\nNara Kun's subject is {nara_info['subject_name'].values[0]}")

Nara Kun Test Information:

   student_id first_name last_name  subject_id  test_score subject_name
5           6       Nara       Kun         4.0        80.0   Literature

Nara Kun's subject is Literature

<b>Exercise 8. Which subject does Mony Sopheak and James Collar take the test on? Display the information, score and subjects of the two students.

In [ ]:
students_info = ex5[
    (ex5['first_name'].isin(['Mony', 'James'])) & 
    (ex5['last_name'].isin(['Sopheak', 'Collar']))
]
print('Mony Sopheak and James Collar Test Information:')
display(students_info[['student_id', 'first_name', 'last_name', 'subject_name', 'test_score']])

Exercise 8 - Mony Sopheak and James Collar Test Information:

    student_id first_name last_name subject_name  test_score
0            1       Mony   Sopheak         Math        55.0
12          13      James    Collar          NaN         NaN